app/controllers/web/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 11 Mar 2014 13:07:42 UTC +00:00], ["text", "ererer"], ["title", "Test34432"], ["updated_at", Tue, 11 Mar 2014 13:07:42 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "posts"."id" = 980190969  [["title", "string29"], ["text", "string30"], ["updated_at", Tue, 11 Mar 2014 15:03:45 UTC +00:00]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)