app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "34"], ["commenter", "43"], ["created_at", Fri, 28 Feb 2014 08:52:16 UTC +00:00], ["post_id", 1], ["updated_at", Fri, 28 Feb 2014 08:52:16 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)