app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("created_at", "image", "text", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 05 Mar 2014 11:48:28 UTC +00:00], ["image", nil], ["text", "werer"], ["title", "LolLol"], ["updated_at", Wed, 05 Mar 2014 11:48:28 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 2  [["title", "Very title"], ["text", "much text\r\nwow"], ["updated_at", Wed, 26 Feb 2014 11:24:05 UTC +00:00]]